###############################################################################
# Created by write_sdc
# Fri Mar 28 02:41:54 2025
###############################################################################
current_design pe_5_2
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 13.3540 [get_ports {array_array_6632d_w}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_widx}]
set_load -pin_load 13.3540 [get_ports {counter_pop_ready}]
set_load -pin_load 13.3540 [get_ports {expose_executed}]
set_load -pin_load 13.3540 [get_ports {fifo_north_pop_ready}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_valid}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_valid}]
set_load -pin_load 13.3540 [get_ports {fifo_west_pop_ready}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[31]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[30]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[29]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[28]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[27]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[26]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[25]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[24]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[23]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[22]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[21]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[20]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[19]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[18]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[17]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[16]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[15]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[14]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[13]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[12]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[11]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[10]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[9]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[8]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[7]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[6]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[5]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[4]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[3]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[2]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[1]}]
set_load -pin_load 13.3540 [get_ports {array_array_6632d_d[0]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[7]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[6]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[5]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[4]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[3]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[2]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[1]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_5_3_west_push_data[0]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[7]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[6]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[5]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[4]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[3]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[2]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[1]}]
set_load -pin_load 13.3540 [get_ports {fifo_pe_6_2_north_push_data[0]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[7]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[6]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[5]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[4]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[3]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[2]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[1]}]
set_load -pin_load 13.3540 [get_ports {pe_5_3_counter_delta[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {counter_delta_ready}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {counter_pop_valid}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_valid}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_pe_5_3_west_push_ready}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_pe_6_2_north_push_ready}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_valid}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pe_5_3_counter_delta_ready}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {array_array_6632d_q[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_north_pop_data[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fifo_west_pop_data[0]}]
###############################################################################
# Design Rules
###############################################################################
