###############################################################################
# Created by write_sdc
# Fri Mar 28 01:47:21 2025
###############################################################################
current_design run_benchmark
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 13.3540 [get_ports {done_port}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[63]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[62]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[61]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[60]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[59]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[58]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[57]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[56]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[55]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[54]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[53]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[52]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[51]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[50]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[49]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[48]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[47]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[46]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[45]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[44]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[43]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[42]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[41]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[40]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[39]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[38]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[37]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[36]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[35]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[34]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[33]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[32]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[31]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[30]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[29]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[28]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[27]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[26]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[25]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[24]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[23]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[22]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[21]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[20]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[19]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[18]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[17]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[16]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[15]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[14]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[13]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[12]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[11]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[10]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[9]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[8]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[7]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[6]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[5]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[4]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[3]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[2]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[1]}]
set_load -pin_load 13.3540 [get_ports {Mout_Wdata_ram[0]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[45]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[44]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[43]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[42]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[41]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[40]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[39]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[38]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[37]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[36]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[35]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[34]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[33]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[32]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[31]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[30]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[29]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[28]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[27]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[26]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[25]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[24]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[23]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[22]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[21]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[20]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[19]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[18]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[17]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[16]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[15]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[14]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[13]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[12]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[11]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[10]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[9]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[8]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[7]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[6]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[5]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[4]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[3]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[2]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[1]}]
set_load -pin_load 13.3540 [get_ports {Mout_addr_ram[0]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[11]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[10]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[9]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[8]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[7]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[6]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[5]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[4]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[3]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[2]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[1]}]
set_load -pin_load 13.3540 [get_ports {Mout_data_ram_size[0]}]
set_load -pin_load 13.3540 [get_ports {Mout_oe_ram[1]}]
set_load -pin_load 13.3540 [get_ports {Mout_oe_ram[0]}]
set_load -pin_load 13.3540 [get_ports {Mout_we_ram[1]}]
set_load -pin_load 13.3540 [get_ports {Mout_we_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start_port}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_DataRdy[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_DataRdy[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[63]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[62]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[61]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[60]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[59]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[58]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[57]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[56]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[55]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[54]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[53]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[52]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[51]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[50]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[49]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[48]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[47]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[46]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[45]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[44]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[43]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[42]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[41]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[40]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[39]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[38]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[37]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[36]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[35]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[34]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[33]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[32]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {M_Rdata_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[63]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[62]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[61]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[60]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[59]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[58]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[57]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[56]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[55]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[54]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[53]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[52]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[51]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[50]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[49]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[48]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[47]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[46]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[45]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[44]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[43]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[42]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[41]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[40]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[39]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[38]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[37]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[36]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[35]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[34]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[33]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[32]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_Wdata_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[45]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[44]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[43]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[42]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[41]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[40]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[39]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[38]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[37]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[36]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[35]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[34]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[33]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[32]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_addr_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_data_ram_size[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_oe_ram[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_oe_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_we_ram[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Min_we_ram[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vargs[0]}]
###############################################################################
# Design Rules
###############################################################################
