###############################################################################
# Created by write_sdc
# Fri Mar 28 01:57:55 2025
###############################################################################
current_design CSRFile
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 13.3540 [get_ports {io_eret}]
set_load -pin_load 13.3540 [get_ports {io_interrupt}]
set_load -pin_load 13.3540 [get_ports {io_evec[31]}]
set_load -pin_load 13.3540 [get_ports {io_evec[30]}]
set_load -pin_load 13.3540 [get_ports {io_evec[29]}]
set_load -pin_load 13.3540 [get_ports {io_evec[28]}]
set_load -pin_load 13.3540 [get_ports {io_evec[27]}]
set_load -pin_load 13.3540 [get_ports {io_evec[26]}]
set_load -pin_load 13.3540 [get_ports {io_evec[25]}]
set_load -pin_load 13.3540 [get_ports {io_evec[24]}]
set_load -pin_load 13.3540 [get_ports {io_evec[23]}]
set_load -pin_load 13.3540 [get_ports {io_evec[22]}]
set_load -pin_load 13.3540 [get_ports {io_evec[21]}]
set_load -pin_load 13.3540 [get_ports {io_evec[20]}]
set_load -pin_load 13.3540 [get_ports {io_evec[19]}]
set_load -pin_load 13.3540 [get_ports {io_evec[18]}]
set_load -pin_load 13.3540 [get_ports {io_evec[17]}]
set_load -pin_load 13.3540 [get_ports {io_evec[16]}]
set_load -pin_load 13.3540 [get_ports {io_evec[15]}]
set_load -pin_load 13.3540 [get_ports {io_evec[14]}]
set_load -pin_load 13.3540 [get_ports {io_evec[13]}]
set_load -pin_load 13.3540 [get_ports {io_evec[12]}]
set_load -pin_load 13.3540 [get_ports {io_evec[11]}]
set_load -pin_load 13.3540 [get_ports {io_evec[10]}]
set_load -pin_load 13.3540 [get_ports {io_evec[9]}]
set_load -pin_load 13.3540 [get_ports {io_evec[8]}]
set_load -pin_load 13.3540 [get_ports {io_evec[7]}]
set_load -pin_load 13.3540 [get_ports {io_evec[6]}]
set_load -pin_load 13.3540 [get_ports {io_evec[5]}]
set_load -pin_load 13.3540 [get_ports {io_evec[4]}]
set_load -pin_load 13.3540 [get_ports {io_evec[3]}]
set_load -pin_load 13.3540 [get_ports {io_evec[2]}]
set_load -pin_load 13.3540 [get_ports {io_evec[1]}]
set_load -pin_load 13.3540 [get_ports {io_evec[0]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[31]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[30]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[29]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[28]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[27]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[26]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[25]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[24]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[23]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[22]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[21]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[20]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[19]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[18]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[17]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[16]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[15]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[14]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[13]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[12]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[11]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[10]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[9]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[8]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[7]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[6]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[5]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[4]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[3]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[2]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[1]}]
set_load -pin_load 13.3540 [get_ports {io_interrupt_cause[0]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[31]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[30]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[29]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[28]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[27]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[26]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[25]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[24]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[23]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[22]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[21]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[20]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[19]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[18]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[17]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[16]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[15]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[14]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[13]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[12]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[11]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[10]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[9]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[8]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[7]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[6]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[5]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[4]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[3]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[2]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[1]}]
set_load -pin_load 13.3540 [get_ports {io_rw_rdata[0]}]
set_load -pin_load 13.3540 [get_ports {io_time[31]}]
set_load -pin_load 13.3540 [get_ports {io_time[30]}]
set_load -pin_load 13.3540 [get_ports {io_time[29]}]
set_load -pin_load 13.3540 [get_ports {io_time[28]}]
set_load -pin_load 13.3540 [get_ports {io_time[27]}]
set_load -pin_load 13.3540 [get_ports {io_time[26]}]
set_load -pin_load 13.3540 [get_ports {io_time[25]}]
set_load -pin_load 13.3540 [get_ports {io_time[24]}]
set_load -pin_load 13.3540 [get_ports {io_time[23]}]
set_load -pin_load 13.3540 [get_ports {io_time[22]}]
set_load -pin_load 13.3540 [get_ports {io_time[21]}]
set_load -pin_load 13.3540 [get_ports {io_time[20]}]
set_load -pin_load 13.3540 [get_ports {io_time[19]}]
set_load -pin_load 13.3540 [get_ports {io_time[18]}]
set_load -pin_load 13.3540 [get_ports {io_time[17]}]
set_load -pin_load 13.3540 [get_ports {io_time[16]}]
set_load -pin_load 13.3540 [get_ports {io_time[15]}]
set_load -pin_load 13.3540 [get_ports {io_time[14]}]
set_load -pin_load 13.3540 [get_ports {io_time[13]}]
set_load -pin_load 13.3540 [get_ports {io_time[12]}]
set_load -pin_load 13.3540 [get_ports {io_time[11]}]
set_load -pin_load 13.3540 [get_ports {io_time[10]}]
set_load -pin_load 13.3540 [get_ports {io_time[9]}]
set_load -pin_load 13.3540 [get_ports {io_time[8]}]
set_load -pin_load 13.3540 [get_ports {io_time[7]}]
set_load -pin_load 13.3540 [get_ports {io_time[6]}]
set_load -pin_load 13.3540 [get_ports {io_time[5]}]
set_load -pin_load 13.3540 [get_ports {io_time[4]}]
set_load -pin_load 13.3540 [get_ports {io_time[3]}]
set_load -pin_load 13.3540 [get_ports {io_time[2]}]
set_load -pin_load 13.3540 [get_ports {io_time[1]}]
set_load -pin_load 13.3540 [get_ports {io_time[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_exception}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_hartid}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_interrupts_debug}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_interrupts_meip}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_interrupts_msip}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_interrupts_mtip}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_retire}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_ungated_clock}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_cause[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_pc[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_addr[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_cmd[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_cmd[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_cmd[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rw_wdata[0]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[31]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[30]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[29]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[28]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[27]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[26]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[25]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[24]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[23]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[22]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[21]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[20]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[19]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[18]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[17]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[16]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[15]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[14]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[13]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[12]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[11]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[10]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[9]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[8]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[7]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[6]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[5]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[4]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[3]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[2]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[1]}]
set_driving_cell -lib_cell BUFx10_ASAP7_75t_R -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_tval[0]}]
###############################################################################
# Design Rules
###############################################################################
